#+STARTUP: show3levels
#+TITLE: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle init.el

* Startup
:PROPERTIES:
:ID:       f17ee97f-febc-4774-acd2-db09c81b5ab8
:END:
This region is some basic/sanity check settings.
Note: Only edit with <C-c '> or else Orgmode will screw up the formatting.
#+BEGIN_SRC emacs-lisp
  ;; SPDX-License-Identifier: MIT

  (setq inhibit-startup-message t)
  (scroll-bar-mode -1) ; Disable visible scrollbar
  (tool-bar-mode -1) ;
  (tooltip-mode -1) ; Disable tooltips
  (set-fringe-mode 10) ; Give some breathing room
  (menu-bar-mode -1) ; Disable the menu bar
  (line-number-mode 1)

  (setq my/monofont "Fira Code"
    		  my/varfont "Monocraft Nerd Font")

  ;; It is important to set some stuff AFTER
  ;; the first frame has been made.
  ;; These settings dont work in the server context.
  (add-hook 'server-after-make-frame-hook
    				  #'(lambda nil
    						  (display-line-numbers-mode 1)
    						  (setq display-line-numbers 'relative)
    						  (global-display-fill-column-indicator-mode 1)
    						  (set-face-attribute 'default nil :font "Fira Code"
    																  :height 120 :weight 'regular)
    						  (set-face-attribute 'variable-pitch nil :font my/varfont 
    																  :height 120)))
  ;; Set up the visible bell
  (setq visible-bell t)
  ;; Make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  ;; (global-set-key (kbd "C-x C-b") 'ibuffer)
  (savehist-mode 1)
  (setq use-dialog-box nil)
  (global-auto-revert-mode 1)
  (setq user-mail-address "sohamg2@gmail.com")
  ;; (setq lsp-prefer-flymake nil)
  (auto-save-visited-mode t)
  (setq make-backup-files nil)
  (setq help-window-select t)
  (setq-default scheme-program-name "guile")
  (tab-bar-mode 1)
  (transient-mark-mode -1)
  ;; Silence compiler warnings as they can be pretty disruptive
  (setq native-comp-async-report-warnings-errors nil)

  ;; Set the right directory to store the native comp cache
  (add-to-list 'native-comp-eln-load-path
    					   (expand-file-name "eln-cache/" user-emacs-directory))

  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (load custom-file)
  ;; Stop annoying pop up of compile command
  (add-to-list 'same-window-buffer-names "*compilation*")

  (setq-default indent-tabs-mode nil)

  (setq epa-pinentry-mode 'loopback)
#+END_SRC

#+RESULTS:
| *compilation* |

** Org Present
:PROPERTIES:
:ID:       278eeb02-1753-4938-a08c-cd21f44010c6
:END:
Test text.
#+BEGIN_SRC emacs-lisp
	(use-package org-present)

	(defun my/org-present-start ()
		(interactive)
		;; Center the presentation and wrap lines
		(setq visual-fill-column-width 800)
		(visual-fill-column-mode 1)
		;; Tweak font sizes
		(variable-pitch-mode 1)
		(buffer-face-set 'variable-pitch)
		(setq writeroom-width 800)
		;; NOTE: These settings might not be ideal for your machine, tweak them as needed!
		(set-face-attribute 'default nil :font my/monofont :weight 'regular :height 120)
		(set-face-attribute 'fixed-pitch nil :font my/monofont :weight 'light :height 120)
		(set-face-attribute 'variable-pitch nil :font my/varfont :weight 'light :height 1.1 )

		(setq face-remapping-alist '((default (:height 1.5) variable-pitch)
																			 (header-line (:height 4.0) variable-pitch)
																			 (org-document-title (:height 1.75) org-document-title)
																			 (org-code (:height 1.55) org-code)
																			 (org-verbatim (:height 1.55) org-verbatim)
																			 (org-block (:height 1.25) org-block)
																			 (org-block-begin-line (:height 0.7) org-block)))

		;; Load org-faces to make sure we can set appropriate faces
		(require 'org-faces)
		;; Hide emphasis markers on formatted text
		(setq-local org-hide-emphasis-markers t)

		;; Resize Org headings
		(dolist (face '((org-level-1 . 1.2)
										(org-level-2 . 1.1)
										(org-level-3 . 1.05)
										(org-level-4 . 1.0)
										(org-level-5 . 1.1)
										(org-level-6 . 1.1)
										(org-level-7 . 1.1)
										(org-level-8 . 1.1)))
			(set-face-attribute (car face) nil :font my/monofont :weight 'bold :height (cdr face)))

		;; ;; Make 
		;; the document title a bit bigger
		(set-face-attribute 'org-document-title nil :font my/varfont :weight 'bold :height 1.3)

		;; Make sure certain org faces use the fixed-pitch face when variable-pitch-mode is on
		(set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
		(set-face-attribute 'org-table nil :inherit 'fixed-pitch)
		(set-face-attribute 'org-formula nil :inherit 'fixed-pitch)
		(set-face-attribute 'org-code nil :inherit '(shadow fixed-pitch))
		(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
		(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
		(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
		(set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
		(visual-line-mode 1))
	(defun my/org-present-end ()
		(interactive)
		;; Stop centering the document
		(visual-fill-column-mode 0)
		(setq face-remapping-alist nil)
		;; Clear the header line string so that it isn't displayed
		(setq header-line-format nil)
		(variable-pitch-mode -1)
		(buffer-face-set 'default)
		;; Stop displaying inline images

								(set-face-attribute 'default nil :font "Fira Code"
																		:height 120 :weight 'regular)
		(org-remove-inline-images)
		(visual-line-mode 0))



	(defun my/org-present-prepare-slide (buffer-name heading)
		;; Show only top-level headlines
		(org-overview)

		;; Unfold the current entry
		(org-show-entry)

		;; Show only direct subheadings of the slide but don't expand them
		(org-show-children))
	;; Turn on variable pitch fonts in Org Mode buffers
	;; (add-hook 'org-present-mode-hook 'variable-pitch-mode)

	;; Register hooks with org-present
	(add-hook 'org-present-mode-hook 'my/org-present-start)
	(add-hook 'org-present-mode-quit-hook 'my/org-present-end)
	(add-hook 'org-present-after-navigate-functions 'my/org-present-prepare-slide)
#+END_SRC

#+RESULTS:
| my/org-present-prepare-slide |

